In [1]:
""" we have different types of functions to perform feature engineering
in which we create some new columns to increase performance of model 
apply(): writing logic in a function then passing as refrence 
map():changing in existing data
assign(): creating new columns with assigning them new value
replace(old,new): replace old value with new """
import pandas as pd

In [20]:
#feature Engineering
#high order function in which we pass function as arguments

#using apply funciton 
df=pd.read_csv("raw_data.csv")

df2=df.copy()
df2["tax"] = df2["income"].apply(lambda x:"20%" if x>=60000 else "10%")

#map(): changing data using dictionary
gender_map={"Male": "M", "Female":"F", "Unknown":"U"}
df2["gender"]=df2["gender"].map(gender_map)

#assign function
df2=df2.assign(new_income=df2["income"]*1.1)

#replace(old,new)
df2["country"]=df2["country"].replace("USA","United States")

In [21]:
df2

    id          name   age        country gender   income  tax  new_income
0    1      John Doe  29.0  United States      M  55000.0  10%     60500.0
1    1      John Doe  29.0  United States      M  55000.0  10%     60500.0
2    2    Jane Smith   NaN         Canada      F  62000.0  20%     68200.0
3    3          Alex   NaN  United States      U  47000.0  10%     51700.0
4    4  Maria Garcia  34.0          Spain      F      NaN  10%         NaN
5    5        Li Wei  27.0          China      M  51000.0  10%     56100.0
6    6           NaN  45.0          India      F  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0            NaN      M  68000.0  20%     74800.0
8    8    Rachel Lee  29.0  United States      F  62000.0  20%     68200.0
9    9   Carlos Ruiz   NaN         Mexico      M  45000.0  10%     49500.0
10  10   Emily Davis  31.0  United States    NaN  58000.0  10%     63800.0

In [ ]:
"""we have some other function to transform data
 rename(columns={old:new})
 sorr_values()
 sort_index()
 reset_index()
 rank()
 reorder_columns
 """

In [32]:
#rename

df2.rename(columns={"income":"Salary"})"changing columns
df2.rename(index={0:"zero"})#changing rows

      id          name   age        country gender   income  tax  new_income
zero   1      John Doe  29.0  United States      M  55000.0  10%     60500.0
1      1      John Doe  29.0  United States      M  55000.0  10%     60500.0
2      2    Jane Smith   NaN         Canada      F  62000.0  20%     68200.0
3      3          Alex   NaN  United States      U  47000.0  10%     51700.0
4      4  Maria Garcia  34.0          Spain      F      NaN  10%         NaN
5      5        Li Wei  27.0          China      M  51000.0  10%     56100.0
6      6           NaN  45.0          India      F  73000.0  20%     80300.0
7      7    Ahmed Khan  38.0            NaN      M  68000.0  20%     74800.0
8      8    Rachel Lee  29.0  United States      F  62000.0  20%     68200.0
9      9   Carlos Ruiz   NaN         Mexico      M  45000.0  10%     49500.0
10    10   Emily Davis  31.0  United States    NaN  58000.0  10%     63800.0

In [57]:
#sorting the values 
df2.sort_values("income")
# df2.sort_values("income", ascending=False)
df2=df2.fillna(50)
sorted_df2=df2.sort_values(["income","age"])
sorted_df2.sort_index()

#reset
sorted_df2.reset_index(drop=True)

#ranking
sorted_df2["Ranking"]=sorted_df2["income"].rank()#ranking based on income
# sorted_df2["Ranking"]=sorted_df2["income"].rank(ascending=False)
# sorted_df2["Ranking"]=sorted_df2["income"].rank(method="dense")
# sorted_df2["Ranking"]=sorted_df2["income"].rank(method="min")
# sorted_df2["Ranking"]=sorted_df2["income"].rank(method="max")

#reordering the columns sequence
sorted_df2[["id","name","age","country","income", "tax","new_income","Ranking","gender"]]

,id,name,age,country,income,tax,new_income,Ranking,gender
4,4,Maria Garcia,34.0,Spain,50.0,10%,50.0,1.0,F
9,9,Carlos Ruiz,50.0,Mexico,45000.0,10%,49500.0,2.0,M
3,3,Alex,50.0,United States,47000.0,10%,51700.0,3.0,U
5,5,Li Wei,27.0,China,51000.0,10%,56100.0,4.0,M
0,1,John Doe,29.0,United States,55000.0,10%,60500.0,5.5,M
1,1,John Doe,29.0,United States,55000.0,10%,60500.0,5.5,M
10,10,Emily Davis,31.0,United States,58000.0,10%,63800.0,7.0,50
8,8,Rachel Lee,29.0,United States,62000.0,20%,68200.0,8.5,F
2,2,Jane Smith,50.0,Canada,62000.0,20%,68200.0,8.5,F
7,7,Ahmed Khan,38.0,50,68000.0,20%,74800.0,10.0,M
6,6,50,45.0,India,73000.0,20%,80300.0,11.0,F